; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation2 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star4)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(have_image Planet5 infrared1)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 thermograph0)
	(have_image Planet9 infrared1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (turn_to satellite1 planet9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet9)
   goals met: 0 of 6
4. (take_image satellite1 planet9 instrument2 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 1 of 6
5. (turn_to satellite1 planet8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet8)
   goals met: 1 of 6
6. (take_image satellite1 planet8 instrument2 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 2 of 6
7. (turn_to satellite1 planet5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet5)
   goals met: 2 of 6
8. (take_image satellite1 planet5 instrument2 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 3 of 6
9. (turn_to satellite1 star6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star6)
   goals met: 3 of 6
10. (take_image satellite1 star6 instrument2 infrared1)
   added: (have_image star6 infrared1)
   goals met: 4 of 6
11. (turn_to satellite1 phenomenon7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 6
12. (take_image satellite1 phenomenon7 instrument2 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 6 of 6
